/*******************************************************************************
*              (c), Copyright 2001, Marvell International Ltd.                 *
* THIS CODE CONTAINS CONFIDENTIAL INFORMATION OF MARVELL SEMICONDUCTOR, INC.   *
* NO RIGHTS ARE GRANTED HEREIN UNDER ANY PATENT, MASK WORK RIGHT OR COPYRIGHT  *
* OF MARVELL OR ANY THIRD PARTY. MARVELL RESERVES THE RIGHT AT ITS SOLE        *
* DISCRETION TO REQUEST THAT THIS CODE BE IMMEDIATELY RETURNED TO MARVELL.     *
* THIS CODE IS PROVIDED "AS IS". MARVELL MAKES NO WARRANTIES, EXPRESSED,       *
* IMPLIED OR OTHERWISE, REGARDING ITS ACCURACY, COMPLETENESS OR PERFORMANCE.   *
********************************************************************************
* cpssExtMacDrv.h
*
* DESCRIPTION:
*
*       CPSS API that that will have PHY MAC extensions.
*      
*   ------------------------------------------------------------------------
*   1    cpssDxChPortSpeedSet
*   2    cpssDxChPortSpeedGet
*   3    cpssDxChPortDuplexAutoNegEnableSet    
*   4    cpssDxChPortDuplexAutoNegEnableGet
*   5    cpssDxChPortFlowCntrlAutoNegEnableSet
*   6    cpssDxChPortFlowCntrlAutoNegEnableGet
*   7    cpssDxChPortSpeedAutoNegEnableSet
*   8    cpssDxChPortSpeedAutoNegEnableGet
*   9    cpssDxChPortFlowControlEnableSet
*  10    cpssDxChPortFlowControlEnableGet
*  11    cpssDxChPortPeriodicFcEnableSet
*  12    cpssDxChPortPeriodicFcEnableGet
*  13    cpssDxChPortBackPressureEnableSet
*  14    cpssDxChPortBackPressureEnableGet

 * Description: the structure holds the "MAC PHY driver interface" functions 
 *
 *  COMMENTS: 
 *  ----------------------------------------------------------------------------------------
 *             API                                             MACPHY function
 *------------------------------------------------------------------------------------------
 *   1    cpssDxChPortSpeedSet                               macDrvMacSpeedSetFunc
 *   2    cpssDxChPortSpeedGet                               macDrvMacSpeedGetFunc
 *   3    cpssDxChPortDuplexAutoNegEnableSet                 macDrvMacDuplexANSetFunc
 *   4    cpssDxChPortDuplexAutoNegEnableGet                 macDrvMacDuplexANGetFunc
 *   5    cpssDxChPortFlowCntrlAutoNegEnableSet              macDrvMacFlowCntlANSetFunc
 *   6    cpssDxChPortFlowCntrlAutoNegEnableGet              macDrvMacFlowCntlANGetFunc
 *   7    cpssDxChPortSpeedAutoNegEnableSet                  macDrvMacSpeedANSetFunc
 *   8    cpssDxChPortSpeedAutoNegEnableGet                  macDrvMacSpeedANGetFunc
 *   9    cpssDxChPortFlowControlEnableSet                   macDrvMacFlowCntlSetFunc
 *  10    cpssDxChPortFlowControlEnableGet                   macDrvMacFlowCntlGetFunc
 *  11    cpssDxChPortPeriodicFcEnableSet                    macDrvMacPeriodFlowCntlSetFunc
 *  12    cpssDxChPortPeriodicFcEnableGet                    macDrvMacPeriodFlowCntlGetFunc
 *  13    cpssDxChPortBackPressureEnableSet                  macDrvMacBackPrSetFunc
 *  14    cpssDxChPortBackPressureEnableGet                  macDrvMacBackPrGetFunc
 *  15    cpssDxChPortLinkStatusGet                          macDrvMacPortlinkGetFunc
 *  16    cpssDxChPortDuplexModeSet                          macDrvMacDuplexSetFunc
 *  17    cpssDxChPortDuplexModeGet                          macDrvMacDuplexGetFunc
 *  18    cpssDxChPortEnableSet                              macDrvMacPortEnableSetFunc
 *  19    cpssDxChPortEnableGet                              macDrvMacPortEnableGetFunc
 *  20    cpssDxChPortExcessiveCollisionDropEnableSet        macDrvMacExcessiveCollisionDropSetFunc
 *  21    cpssDxChPortExcessiveCollisionDropEnableSet        macDrvMacExcessiveCollisionDropGetFunc
 *  22    cpssDxChPortPaddingEnableSet                       macDrvMacPaddingEnableSetFunc
 *  23    cpssDxChPortPaddingEnableGet                       macDrvMacPaddingEnableGetFunc
 *  24    cpssDxChPortPreambleLengthSet                      macDrvMacPreambleLengthSetFunc
 *  25    cpssDxChPortPreambleLengthGet                      macDrvMacPreambleLengthGetFunc
 *  26    cpssDxChPortCrcCheckEnableSet                      macDrvMacCRCCheckSetFunc
 *  27    cpssDxChPortCrcCheckEnableGet                      macDrvMacCRCCheckGetFunc
 *  28    cpssDxChPortMruSet                                 macDrvMacMRUSetFunc
 *  29    cpssDxChPortMruGet                                 macDrvMacMRUGetFunc
 *---------------------------------------------------------------------------------------------
 */
typedef struct{
    CPSS_MACDRV_MAC_SPEED_SET_FUNC              macDrvMacSpeedSetFunc;       /* 1 */
    CPSS_MACDRV_MAC_SPEED_GET_FUNC              macDrvMacSpeedGetFunc;       /* 2 */
    CPSS_MACDRV_DUPLEX_AN_SET_FUNC              macDrvMacDuplexANSetFunc;    /* 3 */
    CPSS_MACDRV_DUPLEX_AN_GET_FUNC              macDrvMacDuplexANGetFunc;    /* 4 */
    CPSS_MACDRV_FLOW_CNTL_AN_SET_FUNC           macDrvMacFlowCntlANSetFunc;  /* 5 */
    CPSS_MACDRV_FLOW_CNTL_AN_GET_FUNC           macDrvMacFlowCntlANGetFunc;  /* 6 */
    CPSS_MACDRV_SPEED_AN_SET_FUNC               macDrvMacSpeedANSetFunc;     /* 7 */
    CPSS_MACDRV_SPEED_AN_GET_FUNC               macDrvMacSpeedANGetFunc;     /* 8 */
    CPSS_MACDRV_FC_ENABLE_SET_FUNC              macDrvMacFlowCntlSetFunc;    /* 9 */
    CPSS_MACDRV_FC_ENABLE_GET_FUNC              macDrvMacFlowCntlGetFunc;    /* 10 */
    CPSS_MACDRV_PERIODIC_FC_ENABLE_SET_FUNC     macDrvMacPeriodFlowCntlSetFunc;    /* 11 */
    CPSS_MACDRV_PERIODIC_FC_ENABLE_GET_FUNC     macDrvMacPeriodFlowCntlGetFunc;    /* 12 */
    CPSS_MACDRV_BP_ENABLE_SET_FUNC              macDrvMacBackPrSetFunc;     /* 13 */
    CPSS_MACDRV_BP_ENABLE_GET_FUNC              macDrvMacBackPrGetFunc;     /* 14 */
    CPSS_MACDRV_PORT_LINK_STATUS_GET_FUNC       macDrvMacPortlinkGetFunc;     /* 15 */
    CPSS_MACDRV_PORT_DUPLEX_SET_FUNC            macDrvMacDuplexSetFunc;     /* 16 */
    CPSS_MACDRV_PORT_DUPLEX_GET_FUNC            macDrvMacDuplexGetFunc;     /* 17 */
    CPSS_MACDRV_PORT_ENABLE_SET_FUNC            macDrvMacPortEnableSetFunc;     /* 18 */
    CPSS_MACDRV_PORT_ENABLE_GET_FUNC            macDrvMacPortEnableGetFunc;     /* 19 */
    CPSS_MACDRV_EXCL_COL_DROP_ENABLE_SET_FUNC   macDrvMacExcessiveCollisionDropSetFunc;  /* 20 */
    CPSS_MACDRV_EXCL_COL_DROP_ENABLE_GET_FUNC   macDrvMacExcessiveCollisionDropGetFunc;  /* 21 */
    CPSS_MACDRV_PADDING_ENABLE_SET_FUNC         macDrvMacPaddingEnableSetFunc;     /* 22 */
    CPSS_MACDRV_PADDING_ENABLE_GET_FUNC         macDrvMacPaddingEnableGetFunc;     /* 23 */
    CPSS_MACDRV_PREAMBLE_LENGTH_SET_FUNC        macDrvMacPreambleLengthSetFunc;     /* 24 */
    CPSS_MACDRV_PREAMBLE_LENGTH_GET_FUNC        macDrvMacPreambleLengthGetFunc;     /* 25 */
    CPSS_MACDRV_CRC_CHECK_ENABLE_SET_FUNC       macDrvMacCRCCheckSetFunc;        /* 26 */
    CPSS_MACDRV_CRC_CHECK_ENABLE_GET_FUNC       macDrvMacCRCCheckGetFunc;        /* 27 */
    CPSS_MACDRV_MRU_SET_FUNC                    macDrvMacMRUSetFunc;        /* 28 */
    CPSS_MACDRV_MRU_GET_FUNC                    macDrvMacMRUGetFunc;        /* 29 */

} CPSS_MACDRV_OBJ_STC;


#ifdef __cplusplus
}
#endif


#endif  /* __cpssExtMacDrvH */


